<a href="https://colab.research.google.com/github/omullaboyev/data-science/blob/main/2_1_9_Pandas_DataFrame_Drop_Columns%26Rows.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data Science va Sun'iy Intellekt Praktikum

Ma'lumotlar Tahlili. Pandas kutubxonasi

2.1 Pandas kutubxonasi bilan ishlash.

2.1.9 Qator va ustunlarni tashlab yuborish

In [3]:
# kutubxonalarni chaqirib olamiz
import pandas as pd
import numpy as np

In [4]:
# data
data = {
        "Yil": [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
        "Aholi soni": [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
        "Temp": [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53],
        "Zichlik": [79.77, 78.68, 77.53, 76.34, 75.13, 73.91, 72.71, 67.03]
} # Yillar bo'yicha O'zbekiston aholisining soni, o'sish tempi va zichligi lug'ati
df = pd.DataFrame(data)
df

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.68
2  2019        32.9  1.56    77.53
3  2018        32.5  1.62    76.34
4  2017        31.9  1.65    75.13
5  2016        31.4  1.66    73.91
6  2015        30.9  1.64    72.71
7  2010        28.5  1.53    67.03

In [5]:
df.index = [21, 20, 19, 18, 17, 16, 15, 10]
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.68
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.34
17  2017        31.9  1.65    75.13
16  2016        31.4  1.66    73.91
15  2015        30.9  1.64    72.71
10  2010        28.5  1.53    67.03

In [6]:
ind = [21, 20, 19, 18, 17, 16, 15, 10] # oddiy ro'yxat yaratamiz
ind.sort() # ro'yxatni tartiblaymiz
ind

[10, 15, 16, 17, 18, 19, 20, 21]

In [9]:
# reindex
df = df.reindex(ind) # reindex aslida yangi DataFrame qaytaradi

#`drop` metodi - qatorlarni tashlab yuborish (asosiy DataFrame o'zgarmaydi)

In [10]:
# df ning 10 indeksli elementni tashlab yuborib yangi DataFrame ga o'zlashtiramiz.
df2 = df.drop(10) # bu yerda axis = 0 degan parametr bor
df2

     Yil  Aholi soni  Temp  Zichlik
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.13
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [11]:
df

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.13
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [12]:
# 15 va 20 indeksli elementlarni tashlab yuborish
df.drop([15, 20])

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.13
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
21  2021        33.9  1.54    79.77

#`drop` metodi - ustunlarni tashlab yuborish (asosiy DataFrame o'zgarmaydi)

In [13]:
# Yil ustunini tashlab yuboramiz
df.drop("Yil", axis = 1) # axis = 1 ning o'rniga axis = "columns" ishlatsa ham bo'ladi

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
16        31.4  1.66    73.91
17        31.9  1.65    75.13
18        32.5  1.62    76.34
19        32.9  1.56    77.53
20        33.5  1.48    78.68
21        33.9  1.54    79.77

In [14]:
df

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.13
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [15]:
df_new = df.drop("Yil", axis = "columns")

In [16]:
df_new

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
16        31.4  1.66    73.91
17        31.9  1.65    75.13
18        32.5  1.62    76.34
19        32.9  1.56    77.53
20        33.5  1.48    78.68
21        33.9  1.54    79.77

#`drop` da `inplace` (joyida) parameteri. Asosiy DataFramenni o'zgaradi.

In [17]:
df.drop("Yil", axis = "columns", inplace = True) # df ning Yil ustunini tashlab yuboradi va o'zgarishlar df ga ta'sir qiladi

In [18]:
df

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
16        31.4  1.66    73.91
17        31.9  1.65    75.13
18        32.5  1.62    76.34
19        32.9  1.56    77.53
20        33.5  1.48    78.68
21        33.9  1.54    79.77

In [19]:
df.drop([10, 15, 20], inplace = True)

In [20]:
df

    Aholi soni  Temp  Zichlik
16        31.4  1.66    73.91
17        31.9  1.65    75.13
18        32.5  1.62    76.34
19        32.9  1.56    77.53
21        33.9  1.54    79.77